package org.itstep.qa.lessons.lesson_one.home;

public class Task02
{ // Написать алгоритм вычисления площади круга
    public static void main(String[] args)
    {
        float p = 3.14f;
        int r = 10;
        float s = p*(r*r);
        System.out.println("Площадь квадрата равна " + s);
    }
}
